app/controllers/messages_controller.rb

  def create
    @message = Message.new(message_params)

    respond_to do |format|
      if @message.save
---
INSERT INTO "messages" ("checksum", "created_at", "dateTime", "msg_body", "msg_head", "read", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)